{
  "backend/main.mo": "Motoko canister that stores products and orders, providing CRUD-style queries and order placement with basic validation.",
  "feature_evidence.json": "Metadata describing implemented features, associated files, components, and test IDs for the project.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files, mapping paths to short descriptions.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables and light/dark mode color palettes.",
  "frontend/index.html": "HTML entry point setting favicon, page title, and loading the root React script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with CartProvider.",
  "frontend/src/cart/CartProvider.tsx": "React context managing cart state, persistence, and operations like add, update, and remove.",
  "frontend/src/cart/cartStorage.ts": "Handles loading, saving, and clearing cart data in localStorage with versioning and bigint serialization.",
  "frontend/src/cart/cartTypes.ts": "Type definitions for cart items and cart state.",
  "frontend/src/components/BrandLogo.tsx": "Displays the handmade crafts logo image with configurable sizing.",
  "frontend/src/components/CategoryIcon.tsx": "Renders a category-specific sprite icon via background positioning.",
  "frontend/src/components/CategoryNav.tsx": "Provides category filter buttons with optional icons for catalog browsing.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with branding, contact info, and a copyright line referencing caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Displays the main navigation bar with site branding, links, and a cart button showing item count.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the overall page layout with header, main content outlet, and footer.",
  "frontend/src/components/ProductCard.tsx": "Displays product info and image with add‑to‑cart support and link to product detail page.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, exposing identity state, login, logout, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Supplies product and order data hooks using the backend actor, including fetching products and placing orders.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines light and dark theme CSS variables for the handmade crafts design.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart page with item management, quantity updates, and cart totals.",
  "frontend/src/pages/CatalogPage.tsx": "Shows the product catalog with category filtering, product listings, and loading skeletons.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements the checkout form, validates buyer info, submits orders for each cart item, and redirects to confirmation after clearing the cart.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero section, category cards, and featured products fetched from the backend.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details using the orderId param, including buyer info and navigation options.",
  "frontend/src/pages/ProductDetailPage.tsx": "Fetches and displays product details with image, description, price, and add-to-cart functionality.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and content paths for styling.",
  "project_state.json": "Stores project metadata including features, requirements, known issues, and image asset expectations."
}